<?php

$arr = [
    "Моссковская область" => [
        "Москва", "Абрамцево", "Алабино", "Апрелевка", "Байконур", "Рошаль"
    ],
    "Санкт-Петербург и область" => [
        "Санкт-Петербург", "Волосово", "Будогощь", "Гатчина", "Бокситогорск"
    ],
    "Алтайский край" => [
        "Алтайский","Благовещенск", "Бурсоль", "Заток", "Волчиха", "Турочак"
    ],
    "Тува (Тувинская Респ.)" => [
        "Самагалтай", "Ак-Довурак", "Чадан", "Шагонар", "Мордор" 
    ]
];

foreach($arr as $key => $value){
    if(is_array($value)){
        $goroda = implode($value,', ');
    }
    echo "$key:<br>$goroda".'<hr>';
}

?>