<?php

$arr = [
    "Моссковская область" => [
        "Москва", "Абрамцево", "Алабино", "Апрелевка", "Байконур", "Рошаль"
    ],
    "Санкт-Петербург и область" => [
        "Санкт-Петербург", "Волосово", "Будогощь", "Гатчина", "Бокситогорск"
    ],
    "Алтайский край" => [
        "Алтайский","Благовещенск", "Бурсоль", "Заток", "Волчиха", "Турочак"
    ],
    "Тува (Тувинская Респ.)" => [
        "Самагалтай", "Ак-Довурак", "Чадан", "Шагонар", "Мордор" 
    ]
];

foreach($arr as $key => $value){
    echo "$key:".'<br>';
    foreach($value as $value2){
        if(mb_substr($value2, 0, 1) == 'А'){
            echo $value2.'<br>';
        }
        }
    }
?>
